{"data":{"allMarkdownRemark":{"edges":[{"node":{"fields":{"slug":"/blog/better_backup/"},"id":"eca99e20-cf7e-5011-87f7-b73e3f67e5af","frontmatter":{"title":"A Better Backup Plan","date":"January 30, 2019"},"html":"<p>Things do not always go as planned - future has a tendency to surprise in many unexpected ways. While accounting for every possible outcome is simply beyond human abilities, it's no reason to skip on planning and let things slide. Having a fallback option is vital as it eliminates fear of failure which severely bogs down and, in worst cases, kills aspirations.</p>\n<p>On the other hand, conceiving an alternative might stifle your performance and hinder your potential. There is a safety net out there, and you subconsciously pull your sleeves down. This might indeed prevent you to execute at the highest level of your abilities in order to achieve set goals. While this sounds reasonable, the truth is that not everyone can transform their fear of failure into motivation - and fear can be absolutely paralysing when stakes are high enough. Moreover, persisting against all odds is rather an exception and, in fairness, not the most efficient approach considering the pace of change nowadays. No doubt you've got to stick to your guns, but at the same time you want to be fluid, able to adapt and evolve along with your environment.</p>\n<p>I think you don't have to mutually exclude these approaches. Instead, pick the best parts and fruitfully combine them. You can still commit completely to your initial objective as if there was no tomorrow even with few fallback options already schemed. It requires sort of a mind trick, though. You've got to stash these backups away and put a lid on them. Carry through with all your energy focused on accomplishing target goals. At the same time, be mindful and perform reality checks. When you realize there is a high probability that it won't pan out, switch to the next plan in chain and indulge in it with the same rigor. Remember - there is always a risk of falling victim to sunken cost fallacy instead of being smart about your next move.</p>\n<p>Speaking of plan composition, at the very least you'll need plan B. It might not\nbe as ambitious as plan A, however keep these two as close as possible in scope.\nPlan Z won't hurt either. That's your insurance, a course of action when everything falls through. Force majeure is real and you'd better be ready when the world comes crashing down.</p>"}},{"node":{"fields":{"slug":"/blog/deep_work/"},"id":"da2ca61b-893f-5aa3-9422-1089818456bf","frontmatter":{"title":"Deep Work","date":"January 09, 2019"},"html":"<p>Let's face it - it's extremely hard to keep your mind at some particular target for prolonged stretch of time without getting your attention diverted. Even if you take measures to protect yourself - by retreating to some hushed place, for instance - the mind keeps racing, only just you are being distracted from within.</p>\n<p>This might not be an issue for the majority of people - after all, our life is comprised of many activities which have to be done swiftly and it's not necessary at all to ponder at some task you've done million times before. Yet for someone who is tackling a complicated problem or trying to learn a difficult topic, distraction is costly - getting back on track isn't something you can do by snapping your fingers. I certainly wish I could take a snapshot of everything in my mind before talking to someone and then immediately roll myself back into it after the conversation is over.</p>\n<p>Attention is akin to a muscle in a sense that it could be built. The stronger it is, the longer is your ability to focus. The longer you can maintain focus, the more quality progress you can make in whatever activity you are engaged. Powering through a tough spot in a problem or task at hand instead of backing down (which is an innate response for the majority of us) might be one of the best exercises out there. You are unlikely to arrive at a solution straight away as it usually starts to click after few intermittent attacks - but that definitely pumps the focus muscle a lot.</p>\n<p>The ability to maintain strong focus opens up a lot of opportunities for both personal and professional development and more often than not unlocks useful insights. Undivided attention is one of your most valuable assets. Nurture it, guard it. And as with any scarce resource, spend wisely.</p>"}},{"node":{"fields":{"slug":"/blog/site_redesign/"},"id":"04abb01c-938e-5acd-8464-4190cd478bda","frontmatter":{"title":"How I Redesigned My Website","date":"February 25, 2018"},"html":"<p>As a \"frontender\" who is paving his way towards fullstack, I tend to work a lot with CLI tools. They are an essential part of my workflow, and console has become a reliable companion over the past couple of years. One day, an odd idea sprang up in my mind - to redesign my personal website, which was a typical collection of webpages with a navbar, as a terminal window. Many people not familiar with programming dread even a glimpse of thought of having to interact with it, and that's understandable. We are all hardwired to fear the unknown. In reality, interacting with command line becomes a breeze once you get familiar with its mechanics - it only takes a little bit of practice.</p>\n<p>Final prototype (with styling) was ready in two days. I had several variations of background in mind, and chose canvas over gradient or some abstract geometrical pattern since it was going to be more challenging - exactly what I needed to solidify recently acquired knowledge about drawing in the browser.</p>\n<p>Flexbox was chosen for the layout due to its wide support. However, slowly but surely Grid is making its way and I definitely plan to implement it in the nearest future as a primary option, with Flexbox as a fallback for older browsers.</p>\n<p><em>\"Responsive or not?\"</em> ceased to be a question long time ago hence I made sure webpage looks great on smaller screens too. Poking into terminal on a phone might sound like a joke, although it's no reason to skip on responsive design despite its challenges. After all, <strong>powell</strong> is meant to be a simplified replica of real-world CLI tool.</p>\n<p>From UX's standpoint, my website is far from ideals of user-friendly, but I hope it would appeal to brothers-and-sisters-in-arms. Made with joy and for the love of web development 🧡.</p>"}},{"node":{"fields":{"slug":"/blog/first_os_contrib/"},"id":"8dc977ed-6c51-5726-975f-63a7fbcd9964","frontmatter":{"title":"First Open Source Contribution","date":"January 05, 2017"},"html":"<p>Yesterday my first PR got merged (woohoo!), which marks the beginning of my path in the open source world.</p>\n<p>Its landscape is vast and diverse, and for a newcomer who is looking for an opportunity to make a contribution for the first time, the task of finding the right issue might seem daunting. I certainly felt a bit lost while navigating through the seemingly endless sea of projects available on GitHub. Luckily, at one point, I stumbled across [this wonderful guide][1] and a set of bite-sized [video lessons made by Kent C. Dodds][2]. The former could be seen as an encyclopedia, covering everything from code of conduct to project maintaining best practices and licensing, while the latter walks you through the complete process of making first-time contribution. I'm especially thankful to Kent since he demystified the whole thing for me =) Only a month ago I held a belief that open source software is all about code, but it turns out that the story doesn't end there - documentation, answering questions, issue triage, translations ... there is so much more to it.</p>\n<p>I really like how everything unfolds so far. I took my learning to the next level while making a positive impact - isn't that a fantastic combination? And the journey has just begun.</p>\n<p><strong>P.S.</strong> Here is a word of encouragement for soon-to-become contributors: no matter the size of your contribution, it makes a difference. Let's improve the world we live in incrementally, one commit at a time.</p></p>\n<h1>[1]: <a href=\"https://opensource.guide/\">https://opensource.guide/</a></h1>\n<h1>[2]: <a href=\"https://egghead.io/courses/how-to-contribute-to-an-open-source-project-on-github\">https://egghead.io/courses/how-to-contribute-to-an-open-source-project-on-github</a></h1>"}}]}}}